# HasDesignParts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..HasDesignParts Property
MEPSystem Class See Also
---
Indicates if the system has one or more design parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasDesignParts { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasDesignParts As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasDesignParts {
	bool get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace